<template>
    <section>
        <div class="relative py-[20px] xl:py-[30px] px-[20px] xl:px-[30px]">
            <div class="xl:max-w-[1300px] mx-auto">
                <Breadcrumb customClass="mb-[30px]" />
                <HomeInfo :datas="infoDatas" />
                <HomeProduct
                    v-if="productDatas"
                    class="mt-5"
                    :datas="productDatas"
                />
            </div>
        </div>
    </section>
</template>
<script setup lang="ts">
import { ref } from "vue";
import HomeInfo from "./components/HomeInfo.vue";
import HomeProduct from "./components/HomeProduct.vue";
import Breadcrumb from "@/components/Breadcrumb";

const infoDatas = ref([
    {
        id: 1,
        date: "2021-10-01",
        category: "報告上架通知",
        text: "2023 年 11 月產業鏈價格預測月報告已發佈至報告下載專區。",
        content: "<p>2023年11月產業鏈價格預測月報告已發佈至報告下載專區。</p>",
    },
    {
        id: 2,
        date: "2021-11-01",
        category: "報告延遲通知",
        text: "2023 年 11 月產業鏈價格預測月報告將延至 2023/11/10 發行。",
        content: "<p>2023年11月產業鏈價格預測月報告已發佈至報告下載專區。</p>",
    },
    {
        id: 3,
        date: "2021-11-01",
        category: "報告延遲通知",
        text: "2023年11月產業鏈價格預測月報告已發佈至報告下載專區。",
        content: "<p>2023年11月產業鏈價格預測月報告已發佈至報告下載專區。</p>",
    },
]);

const productDatas = ref([
    {
        id: 1,
        category: "太陽能",
        products: [
            {
                id: 1,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 2,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 3,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 4,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 5,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 6,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 7,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 8,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
        ],
    },
    {
        id: 2,
        category: "儲能",
        products: [
            {
                id: 11,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 12,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 13,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 14,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 15,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 16,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 17,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 18,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
        ],
    },
    {
        id: 3,
        category: "科技產業",
        products: [
            {
                id: 21,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 22,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 23,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 24,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 25,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 26,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 27,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 28,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
        ],
    },
    {
        id: 4,
        category: "科技產業2",
        products: [
            {
                id: 31,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 32,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 33,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 34,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 35,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 36,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 37,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
            {
                id: 38,
                text: "全球鋰電池供應鏈數據庫",
                content:
                    "<p>全球鋰電池供應鏈數據庫報告涵蓋全球鋰電池市場供需情形，提供電芯環節的細部數據，包括各企業的產能、產量、出貨等，且拆分各市場應用別如大型與工商業儲能、戶用儲能。除了詳細數據資料，全球鋰電池供應鏈數據庫也提供全產業鏈上的綜觀與趨勢分析，協助企業作為策略佈局的重要依據。</p>",
            },
        ],
    },
]);
</script>
